{
    "Adventure": "Stories that involve characters embarking on journeys, often to explore new lands or face challenges.",
    "Shounen": "Targeted primarily towards young male audiences, typically featuring action-packed plots and themes of friendship, rivalry, and self-improvement.",
    "Romance": "Focuses on the romantic relationships between characters, exploring themes of love, attraction, and emotional connection.",
    "Samurai": "Set in feudal Japan or featuring samurai characters, often involving sword-fighting, honor, and loyalty.",
    "Horror": "Intended to evoke fear, dread, or unease in the audience through suspenseful or frightening elements.",
    "Psychological": "Explores the human mind and behavior, often delving into complex psychological themes such as identity, perception, and trauma.",
    "Demons": "Involves supernatural beings or creatures, often focusing on conflicts between humans and demons or demon hunters.",
    "Dementia": "Characterized by a surreal or disorienting narrative style, often exploring themes of memory loss, confusion, or existentialism.",
    "Sci-Fi": "Set in futuristic or speculative worlds, featuring advanced technology, space exploration, and scientific concepts.",
    "Thriller": "Emphasizes suspense, tension, and anticipation, often involving high-stakes situations and unexpected plot twists.",
    "Super Power": "Features characters with extraordinary abilities or powers, often used in battles or to confront larger-than-life challenges.",
    "Comedy": "Intended to amuse and entertain, often featuring humor, wit, and exaggerated situations.",
    "Magic": "Involves supernatural or mystical elements, such as spells, wizards, and magical creatures.",
    "Martial Arts": "Centers around the practice and mastery of martial arts techniques, often featuring intense combat scenes.",
    "Mecha": "Focuses on large robotic machines or mechs, often used in futuristic warfare or as tools for exploration.",
    "Action": "Characterized by fast-paced sequences of physical activity, such as fighting, chases, and stunts.",
    "Mystery": "Involves the investigation and solving of a puzzling or enigmatic situation, often featuring detectives or amateur sleuths.",
    "Music": "Centers around music and musicians, often exploring themes of passion, creativity, and self-expression.",
    "Sports": "Features competitive sports as a central element, often focusing on teamwork, rivalry, and personal growth.",
    "Military": "Set in military settings or featuring characters involved in armed conflict, often exploring themes of duty, honor, and sacrifice.",
    "School": "Takes place primarily in a school environment, focusing on the lives and experiences of students and teachers.",
    "Game": "Involves characters participating in games or competitions, often with high stakes or unconventional rules.",
    "Drama": "Emphasizes realistic portrayals of emotional conflict, relationships, and personal growth.",
    "Police": "Centers around law enforcement officers or agencies, often involving crime-solving and justice-seeking narratives.",
    "Historical": "Set in a specific historical period or featuring events, characters, or settings from the past.",
    "Fantasy": "Involves magical or fantastical elements, such as mythical creatures, enchanted lands, and epic quests.",
    "Cars": "Features automobiles as a central theme, often involving racing, customization, or automotive culture.",
    "Seinen": "Targeted towards adult male audiences, often featuring mature themes and complex characters.",
    "Space": "Set in outer space or featuring space exploration, often exploring themes of discovery, adventure, and survival.",
    "Vampire": "Involves vampires or vampire-like creatures, often exploring themes of immortality, bloodlust, and forbidden love.",
    "Supernatural": "Features supernatural phenomena or beings, such as ghosts, spirits, or otherworldly powers.",
    "Kids": "Geared towards young children, often featuring simple stories, colorful characters, and educational elements.",
    "Shoujo": "Targeted towards young female audiences, often focusing on themes of romance, friendship, and self-discovery.",
    "Slice of Life": "Portrays everyday life and experiences in a realistic or semi-realistic manner, often focusing on character relationships and personal development.",
    "Parody": "Satirizes or mocks other works or genres, often through exaggerated or comedic reinterpretations."
}
  